## How to get Month, Year, Date, Week information form Date Column

In [1]:
# importing pandas as pd
import pandas as pd

In [2]:
# Creating the dataframe
df=pd.DataFrame({'Date':['2015-12-01','2016-12-02','2017-12-03','2018-12-04','2019-12-05'],
                 'Store':['A1','B1','E2','C1','D1'],
                 'Sales':[2000,4000,5000,2000,6000]})

In [3]:
# Now we will check the data type  
df.dtypes

Date     object
Store    object
Sales     int64
dtype: object

In [4]:
# Print the dataframe
df

         Date Store  Sales
0  2015-12-01    A1   2000
1  2016-12-02    B1   4000
2  2017-12-03    E2   5000
3  2018-12-04    C1   2000
4  2019-12-05    D1   6000

In [5]:
# to_datetime function use to convert datetime datatype

# convert the 'Date1' column to datetime format
df['Date']=pd.to_datetime(df.Date)

In [6]:
# Check the format of 'Date' column
df.dtypes

Date     datetime64[ns]
Store            object
Sales             int64
dtype: object

In [7]:
df

        Date Store  Sales
0 2015-12-01    A1   2000
1 2016-12-02    B1   4000
2 2017-12-03    E2   5000
3 2018-12-04    C1   2000
4 2019-12-05    D1   6000

In [8]:
#Extract year from Date Column
df['year']=pd.DatetimeIndex(df.Date).year

In [9]:
df

        Date Store  Sales  year
0 2015-12-01    A1   2000  2015
1 2016-12-02    B1   4000  2016
2 2017-12-03    E2   5000  2017
3 2018-12-04    C1   2000  2018
4 2019-12-05    D1   6000  2019

In [11]:
#Extract month from Date Column
df['month']=pd.DatetimeIndex(df.Date).month

#Extract day from Date Column
df['day']=pd.DatetimeIndex(df.Date).day

#Extract week from Date Column
df['week']=pd.DatetimeIndex(df.Date).week

#Extract weekday from Date Column
df['weekday']=pd.DatetimeIndex(df.Date).weekday

In [12]:
df

        Date Store  Sales  year  month  day  week  weekday
0 2015-12-01    A1   2000  2015     12    1    49        1
1 2016-12-02    B1   4000  2016     12    2    48        4
2 2017-12-03    E2   5000  2017     12    3    48        6
3 2018-12-04    C1   2000  2018     12    4    49        1
4 2019-12-05    D1   6000  2019     12    5    49        3

Extract **month and weekday** information with Name 'WEDNESDAY'

In [13]:
# importing datime library
import datetime as dt

In [14]:
print(dir(dt))

['MAXYEAR', 'MINYEAR', '__builtins__', '__cached__', '__doc__', '__file__', '__loader__', '__name__', '__package__', '__spec__', 'date', 'datetime', 'datetime_CAPI', 'time', 'timedelta', 'timezone', 'tzinfo']

#### Date Formating

- **Code:	Meaning	          .....    Example** <br>
- %A : Weekday as locale’s full name.  ......
[ Wednesday] <br>
- %a :	Weekday as locale’s abbreviated name.	.....[Wed]<br>
- %B:	Month as locale’s full name.	......[June]<br>
- %d:	Day of the month.	......[06]<br>
- %m:	Month as a number.	.....[6]<br>
- %Y:	Four-digit year.	......[2018]<br>
- %y:	Two-digit year.	......[18]<br>

In [15]:
df

        Date Store  Sales  year  month  day  week  weekday
0 2015-12-01    A1   2000  2015     12    1    49        1
1 2016-12-02    B1   4000  2016     12    2    48        4
2 2017-12-03    E2   5000  2017     12    3    48        6
3 2018-12-04    C1   2000  2018     12    4    49        1
4 2019-12-05    D1   6000  2019     12    5    49        3

In [24]:
df.Date.dt.strftime("%Y/%m/%d")

0    2015/12/01
1    2016/12/02
2    2017/12/03
3    2018/12/04
4    2019/12/05
Name: Date, dtype: object

In [25]:
df['weekday1']=df.Date.dt.strftime("%A")

In [26]:
df

        Date Store  Sales  year  month  day  week  weekday  weekday1
0 2015-12-01    A1   2000  2015     12    1    49        1   Tuesday
1 2016-12-02    B1   4000  2016     12    2    48        4    Friday
2 2017-12-03    E2   5000  2017     12    3    48        6    Sunday
3 2018-12-04    C1   2000  2018     12    4    49        1   Tuesday
4 2019-12-05    D1   6000  2019     12    5    49        3  Thursday

In [27]:
df['month1']=df.Date.dt.strftime("%B")

In [28]:
df

        Date Store  Sales  year  month  day  week  weekday  weekday1    month1
0 2015-12-01    A1   2000  2015     12    1    49        1   Tuesday  December
1 2016-12-02    B1   4000  2016     12    2    48        4    Friday  December
2 2017-12-03    E2   5000  2017     12    3    48        6    Sunday  December
3 2018-12-04    C1   2000  2018     12    4    49        1   Tuesday  December
4 2019-12-05    D1   6000  2019     12    5    49        3  Thursday  December

----------------------------------------------Thank you & Happy Learning------------------------------------------------------